; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	satellite2 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	satellite3 - satellite
	instrument5 - instrument
	instrument6 - instrument
	satellite4 - satellite
	instrument7 - instrument
	instrument8 - instrument
	spectrograph0 - mode
	image1 - mode
	Star4 - direction
	GroundStation8 - direction
	Star1 - direction
	Star2 - direction
	Star5 - direction
	GroundStation0 - direction
	GroundStation6 - direction
	GroundStation7 - direction
	GroundStation3 - direction
	Phenomenon9 - direction
	Phenomenon10 - direction
	Planet11 - direction
	Planet12 - direction
	Planet13 - direction
	Phenomenon14 - direction
	Star15 - direction
	Star16 - direction
	Planet17 - direction
)
(:init
	(supports instrument0 spectrograph0)
	(supports instrument0 image1)
	(calibration_target instrument0 GroundStation3)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon9)
	(supports instrument1 spectrograph0)
	(calibration_target instrument1 GroundStation3)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation6)
	(supports instrument2 spectrograph0)
	(calibration_target instrument2 GroundStation3)
	(calibration_target instrument2 Star2)
	(supports instrument3 image1)
	(supports instrument3 spectrograph0)
	(calibration_target instrument3 Star1)
	(supports instrument4 image1)
	(supports instrument4 spectrograph0)
	(calibration_target instrument4 Star1)
	(on_board instrument2 satellite2)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation8)
	(supports instrument5 image1)
	(supports instrument5 spectrograph0)
	(calibration_target instrument5 Star2)
	(supports instrument6 spectrograph0)
	(supports instrument6 image1)
	(calibration_target instrument6 GroundStation0)
	(calibration_target instrument6 Star5)
	(calibration_target instrument6 GroundStation3)
	(on_board instrument5 satellite3)
	(on_board instrument6 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Planet17)
	(supports instrument7 spectrograph0)
	(calibration_target instrument7 GroundStation7)
	(calibration_target instrument7 GroundStation6)
	(supports instrument8 spectrograph0)
	(supports instrument8 image1)
	(calibration_target instrument8 GroundStation3)
	(on_board instrument7 satellite4)
	(on_board instrument8 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Planet13)
)
(:goal (and
	(pointing satellite2 Star16)
	(pointing satellite3 GroundStation8)
	(pointing satellite4 Phenomenon14)
	(have_image Phenomenon9 spectrograph0)
	(have_image Phenomenon10 image1)
	(have_image Planet11 spectrograph0)
	(have_image Planet12 image1)
	(have_image Planet13 image1)
	(have_image Phenomenon14 spectrograph0)
	(have_image Star15 image1)
	(have_image Star16 image1)
	(have_image Planet17 image1)
))

)

; plan
1. (turn_to satellite2 star1 groundstation8)
   deleted: (pointing satellite2 groundstation8)
   added: (pointing satellite2 star1)
   goals met: 0 of 12
2. (switch_on instrument3 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument3)
   goals met: 0 of 12
3. (calibrate satellite2 instrument3 star1)
   added: (calibrated instrument3)
   goals met: 0 of 12
4. (turn_to satellite2 planet12 star1)
   deleted: (pointing satellite2 star1)
   added: (pointing satellite2 planet12)
   goals met: 0 of 12
5. (take_image satellite2 planet12 instrument3 image1)
   added: (have_image planet12 image1)
   goals met: 1 of 12
6. (turn_to satellite2 planet11 planet12)
   deleted: (pointing satellite2 planet12)
   added: (pointing satellite2 planet11)
   goals met: 1 of 12
7. (take_image satellite2 planet11 instrument3 spectrograph0)
   added: (have_image planet11 spectrograph0)
   goals met: 2 of 12
8. (turn_to satellite2 phenomenon9 planet11)
   deleted: (pointing satellite2 planet11)
   added: (pointing satellite2 phenomenon9)
   goals met: 2 of 12
9. (take_image satellite2 phenomenon9 instrument3 spectrograph0)
   added: (have_image phenomenon9 spectrograph0)
   goals met: 3 of 12
10. (turn_to satellite2 phenomenon14 phenomenon9)
   deleted: (pointing satellite2 phenomenon9)
   added: (pointing satellite2 phenomenon14)
   goals met: 3 of 12
11. (take_image satellite2 phenomenon14 instrument3 spectrograph0)
   added: (have_image phenomenon14 spectrograph0)
   goals met: 4 of 12
12. (turn_to satellite2 phenomenon10 phenomenon14)
   deleted: (pointing satellite2 phenomenon14)
   added: (pointing satellite2 phenomenon10)
   goals met: 4 of 12
13. (take_image satellite2 phenomenon10 instrument3 image1)
   added: (have_image phenomenon10 image1)
   goals met: 5 of 12
14. (turn_to satellite2 planet13 phenomenon10)
   deleted: (pointing satellite2 phenomenon10)
   added: (pointing satellite2 planet13)
   goals met: 5 of 12
15. (take_image satellite2 planet13 instrument3 image1)
   added: (have_image planet13 image1)
   goals met: 6 of 12
16. (turn_to satellite2 planet17 planet13)
   deleted: (pointing satellite2 planet13)
   added: (pointing satellite2 planet17)
   goals met: 6 of 12
17. (take_image satellite2 planet17 instrument3 image1)
   added: (have_image planet17 image1)
   goals met: 7 of 12
18. (turn_to satellite2 star15 planet17)
   deleted: (pointing satellite2 planet17)
   added: (pointing satellite2 star15)
   goals met: 7 of 12
19. (take_image satellite2 star15 instrument3 image1)
   added: (have_image star15 image1)
   goals met: 8 of 12
20. (turn_to satellite2 star16 star15)
   deleted: (pointing satellite2 star15)
   added: (pointing satellite2 star16)
   goals met: 9 of 12
21. (take_image satellite2 star16 instrument3 image1)
   added: (have_image star16 image1)
   goals met: 10 of 12
22. (turn_to satellite3 groundstation8 planet17)
   deleted: (pointing satellite3 planet17)
   added: (pointing satellite3 groundstation8)
   goals met: 11 of 12
23. (turn_to satellite4 phenomenon14 planet13)
   deleted: (pointing satellite4 planet13)
   added: (pointing satellite4 phenomenon14)
   goals met: 12 of 12
